{
  "definitions": [
    {
      "category": "html",
      "title": "Codepen",
      "description": "Ferramenta online para testar e apresentar trechos de código HTML, CSS e JavaScript criados pelo usuário."
    },
    {
      "category": "html",
      "title": "Elemento HTML <head>",
      "description": "Providencia informações gerais (metadados) sobre o documento, incluindo seu título e links para scripts e folhas de estilos."
    },
    {
      "category": "html",
      "title": "Elemento HTML <body>",
      "description": "Representa o conteúdo de um documento HTML. É permitido apenas um <body> por documento."
    },

    {
      "category": "html",
      "title": "Atributo charset",

      "description": "Serve para indicar o formato de codificação de caracteres utilizado no documento."
    },

    {
      "category": "html",
      "title": "Elemento HTML <link>",

      "description": "Especifica as relações entre o documento atual e um recurso externo. Este elemento é mais usado para vincular as folhas de estilo."
    },

    {
      "category": "html",
      "title": "CSS Grid",

      "description": "É um sistema de estruturação de layout que o CSS fornece. Ele permite configurar layouts em duas dimensões (linhas e colunas). A junção de linhas e colunas formam uma grade, o que dá o nome a esse sistema (Grid)."
    },
    {
      "category": "html",
      "title": "Link",

      "description": "Uma referência dentro de um documento em HTML a outras partes desse documento ou a outro documento."
    },

    {
      "category": "html",
      "title": "Links relativos",

      "description": "São links que levam para qualquer conteúdo que está na mesma pasta do projeto, como um arquivo HTML, imagem, vídeo, etc..."
    },

    {
      "category": "html",
      "title": "Links absolutos",
      "description": "São links que apontam para um local definido por sua localização absoluta na web, incluindo protocolo e nome de domínio, exemplo: https://app.staart.com/"
    },

    {
      "category": "html",
      "title": "Id",

      "description": "O atributo global id define um identificador exclusivo que deve ser único por todo o documento. Seu objetivo é identificar o elemento ao navegar por âncoras (usando um identificador de fragmento), quando estilizar com CSS ou utilizando scripts."
    },

    {
      "category": "html",
      "title": "Class",

      "description": "O atributo class permite o CSS e o JavaScript selecionar e acessar elementos específicos através dos seletores de classe com CSS ou funções com o JavaScript."
    },

    {
      "category": "html",
      "title": "Seletores",

      "description": "É uma funcionalidade do CSS que permite selecionarmos qual elemento do HTML queremos customizar."
    },

    {
      "category": "html",
      "title": "Pseudo-classes",

      "description": "É uma palavra-chave adicionada a seletores que especifica um estado especial do elemento selecionado. Por exemplo, quando se quer adicionar uma customização para um botão somente quando o ponteiro do mouse passar por cima dele."
    },
    {
      "category": "html",
      "title": "Background",

      "description": "A propriedade CSS background é usada para definir os valores de fundo individuais em um único lugar na folha de estilo."
    },
    {
      "category": "html",
      "title": "Responsividade",

      "description": "É uma técnica utilizada para fazer com que um site adapte seu conteúdo para diferentes tamanhos de tela, seja notebooks, tablets, smartphones ou até mesmo smartwatches."
    },

    {
      "category": "html",
      "title": "Visibilidade",
      "description": "A propriedade CSS de visibilidade pode mostrar ou ocultar um elemento sem afetar o layout de um documento. Ou seja, caso oculto, o elemento não aparecerá na página mas seu espaço continua sendo ocupado."
    },
    {
      "category": "html",
      "title": "Google Fonts",
      "description": "Biblioteca com mais de 800 fontes livres licenciadas e um diretório web interativo para navegar na biblioteca."
    },
    {
      "category": "html",
      "title": "Keyframes",
      "description": "Nos permitem indicar o estado inicial e final do estilo CSS em uma animação. Nós podemos, inclusive, indicar o estado do estilo CSS em nenhum ou vários pontos de uma animação entre o início e o fim dela."
    },
    {
      "category": "javascript",
      "title": "O que são comentários?",
      "description": "Anotações que podem ser incluídas no código para descrever o que se quiser. Comentários não mudam o comportamento de um programa executado e servem somente para ajudar o programador a melhor organizar os seus códigos."
    },
    {
      "category": "javascript",
      "title": "Full Stack",
      "description": "Profissional que tem um perfil mais amplo, podendo atuar tanto na construção de sites e sistemas web quanto na construção de sistemas que executem em servidores."
    },

    {
      "category": "javascript",
      "title": "Fábrica de software",
      "description": "Empresa especializada em desenhar, desenvolver, integrar e sustentar sistemas e aplicações personalizados em escala para outras organizações."
    },
    {
      "category": "javascript",
      "title": "Features",
      "description": "São funcionalidades ou recursos de produtos e plataformas digitais."
    },
    {
      "category": "javascript",
      "title": "Pensamento Computacional",
      "description": "O processo de pensamento envolvido na formulação de um problema e na criação de sua solução, de forma que alguém consiga executar a mesma várias vezes."
    },
    {
      "category": "javascript",
      "title": "Programa",
      "description": "Sequência de passos que um computador vai conseguir executar."
    },
    {
      "category": "javascript",
      "title": "Framework",
      "description": "Um conjunto de pacotes com funcionalidades para serem usadas em um projeto. Também oferece uma estrutura a ser seguida para o desenvolvimento do projeto."
    },
    {
      "category": "javascript",
      "title": "Documentação",
      "description": "Manual que dita a forma de uso de uma ferramenta ou linguagem de programação, com exemplos de uso e todas as funcionalidades disponíveis para aquele recurso."
    },
    {
      "category": "javascript",
      "title": "Output",
      "description": "É a 'Saída do programa', onde será exibido o resultado da pós execução dos nossos programas."
    },
    {
      "category": "javascript",
      "title": "Comentário",
      "description": "Anotações que podem ser incluídas no código para descrever o que se quiser., Comentários não mudam o comportamento de um programa executado e servem somente para ajudar o programador a melhor organizar os seus códigos."
    },
    {
      "category": "javascript",
      "title": "Variável",
      "description": "Objeto capaz de guardar e representar um valor ou expressão em um programa."
    },

    {
      "category": "javascript",
      "title": "Objeto",
      "description": "Utilizado para mapear objetos do mundo real e suas propriedades como nome, altura e idade no caso de uma pessoa, ou até mesmo detalhes do ambiente como temperatura, umidade, etc."
    },
    {
      "category": "javascript",
      "title": "Arrays",
      "description": "Utilizado para criação de listas como lista de itens em um carrinho de compras, nomes de usuários aprovados em um teste, etc."
    },
    {
      "category": "javascript",
      "title": "React",
      "description": "Biblioteca JavaScript de código aberto com foco em criar interfaces de usuário em páginas web”."
    },
    {
      "category": "javascript",
      "title": "Front End",
      "description": "Tudo o que você vê na sua tela ao acessar algum site é considerado Front End. Front End significa “o que está a frente”, portanto é o que pode ser visualizado pelo usuário ao visitar um site ou abrir um aplicativo."
    },
    {
      "category": "javascript",
      "title": "Libs ou Pacotes",
      "description": "São códigos construídos para serem baixados e utilizados por qualquer pessoa que queria adicionar esse código pronto no seu projeto."
    },
    {
      "category": "javascript",
      "title": "Frameworks",
      "description": "Ferramentas que fornecem códigos genéricos que podem ser usados para criar os seus projetos com uma estrutura definida."
    },
    {
      "category": "javascript",
      "title": "Tags",
      "description": "Estruturas de linguagem de marcação contendo instruções, tendo uma marca de início e outra de fim para que o navegador possa carregar uma página."
    },
    {
      "category": "javascript",
      "title": "Tag <head>",
      "description": "Quando elementos são inseridos nessa tag, eles não aparecerão na página do site, já que são utilizadas apenas para configurações."
    },
    {
      "category": "javascript",
      "title": "Tag <body>",
      "description": "Aqui são inseridas todas as tags que formarão o corpo do seu site, como títulos, seções, imagens, vídeos, formulários, etc"
    },
    {
      "category": "javascript",
      "title": "Tag <p>",
      "description": "Tag para inserir textos (parágrafos) que aparecerão na tela."
    },
    {
      "category": "javascript",
      "title": "CSS",
      "description": "Cascading Style Sheets é um mecanismo para adicionar estilo a um documento web."
    },
    {
      "category": "javascript",
      "title": "V8",
      "description": "V8 foi construído pelo Google. É um projeto de código aberto e escrito em C++. O objetivo era aumentar a performance de execução do JavaScript dentro de navegadores a fim de obter velocidade. Ele `traduz` código JavaScript em código de máquina ao invés de interpretar e por isso não produz qualquer código intermediário."
    },
    {
      "category": "javascript",
      "title": "Netscape",
      "description": "Foi um navegador web proprietário lançado em dezembro de 1994 e foi o principal produto da Netscape Communications Corporation."
    },
    {
      "category": "javascript",
      "title": "ECMA",
      "description": "Associação fundada em 1961 dedicada à padronização de sistemas de informação Desde 1994 passou a se denominar ECMA International para refletir suas atividades internacionais."
    },
    {
      "category": "javascript",
      "title": "Node.js",
      "description": "Software de código aberto, multiplataforma, baseado no motor de execução V8 e que permite a execução de códigos JavaScript fora de um navegador."
    }
  ]
}
